Repository: DIKO-Doc/DIKO-Doc.github.io
Catalog: cht-to-eng/cht-to-eng-omegat.tmx
Source language: zh_tw
Languages: en

source: invalid use of const_cast with type %qT, which is a pointer or reference to a function type
en: 在類型 %qT 上使用 const_cast 無效，因為它是一個指標函式類型的指標或參照

source: invalid use of const_cast with type %qT, which is not a pointer, reference, nor a pointer-to-data-member type
en: 在類型 %qT 上使用 const_cast 無效，因為它既不是指標，也不是參照，也不是資料成員指標

source: invalid use of constructor as a template
en: 將建構式做為範本用法無效

source: invalid use of flexible array member
en: 對彈性陣列成員無效的使用

source: invalid use of incomplete typedef %qD
en: 對不完全的 typedef %qD 的無效使用

source: invalid use of member %q+D in static member function
en: 在靜態成員函式中使用成員 %q+D 無效

source: invalid use of non-lvalue array
en: 對非左值陣列的無效使用

source: invalid use of non-static data member %q+D
en: 對非靜態資料成員 %q+D 的無效使用

source: invalid use of non-static data member %qD
en: 對非靜態資料成員 %qD 的無效使用

source: invalid use of non-static member function %qD
en: 對非靜態成員函式 %qD 的使用無效

source: invalid use of nonstatic data member %qE
en: 對非靜態資料成員 %qE 的使用無效

source: invalid use of template-id %qD in declaration of primary template
en: 在基本範本的宣告中對範本識別碼 %qD 的使用無效

source: invalid use of type %qT as a default value for a template template-parameter
en: 將類型 %qT 做為範本的範本參數的預設值無效

source: invalid use of undefined type %<%s %E%>
en: 對未定義類型 %<%s %E%> 的使用無效

source: invalid use of void expression
en: 對 void 運算式的無效使用

source: invalid value
en: 無效值

source: invalid value for "%s": %s
en: “...的值無效”%s": %s

source: invalid vector type for attribute %qE
en: 屬性 %qE 的向量類型無效

source: invoke[non-static] on static method
en: 非靜態地呼叫靜態方法

source: invokestatic on abstract method
en: 為抽象方法呼叫 invokestatic

source: invokestatic on non static method
en: 靜態呼叫非靜態方法

source: ip4 default
en: ip4默認

source: ip6 default
en: ip6默認

source: is not a JSON object
en: 不是JSON對象

source: is not a valid MAC address
en: 不是個有效的 MAC 位址

source: its dest_idx should be %d, not %d
en: 它的 dest_idx 應當是 %d 而不是 %d

source: iwmmxt abi requires an iwmmxt capable cpu
en: iwmmxt abi 需要相應 CPU 的支援

source: jcf-dump: no classes specified
en: jcf-dump：未指定類別

source: jump into statement expression
en: 跳轉至敘述運算式中

source: jump to case label
en: 跳轉至 case 標籤

source: jump to label %q+D
en: 跳轉至標籤 %q+D

source: jump to label %qD
en: 跳轉至標籤 %qD

source: junk at end of #pragma %s
en: #pragma %s 末尾有無用字元

source: junk at end of #pragma GCC java_exceptions
en: #pragma GCC java_exceptions 末尾有無用字元

source: junk at end of #pragma GCC memregs [0..16]
en: #pragma GCC memregs [0..16] 末尾有無用字元

source: junk at end of #pragma ghs endsda
en: #pragma ghs endsda 末尾有無用字元

source: junk at end of #pragma ghs endtda
en: #pragma ghs endtda 末尾有無用字元

source: junk at end of #pragma ghs interrupt
en: #pragma ghs interrupt 末尾有無用字元

source: junk at end of #pragma ghs startsda
en: #pragma ghs startsda 末尾有無用字元

source: junk at end of #pragma ghs starttda
en: #pragma ghs starttda 末尾有無用字元

source: junk at end of #pragma ghs startzda
en: #pragma ghs startzda 末尾有無用字元

source: junk at end of %<#pragma GCC visibility%>
en: %<#pragma GCC visibility%> 末尾有無用字元

source: junk at end of %<#pragma align%>
en: %<#pragma align%> 末尾有無用字元

source: junk at end of %<#pragma fini%>
en: %<#pragma fini%> 末尾有無用字元

source: junk at end of %<#pragma init%>
en: %<#pragma init%> 末尾有無用字元

source: junk at end of %<#pragma pack%>
en: %<#pragma pack%> 末尾有無用字元

source: junk at end of '#pragma options'
en: 「#pragma options」末尾有無用字元

source: junk at end of signature string
en: 簽名稱符串末尾有無用字元

source: key '%s.%s' is not boolean
en: 鑰匙'%s.%s' 不是布爾值

source: key cannot contain ".."
en: key不能包含“..”

source: key must be UTF8
en: 密鑰必須是UTF8

source: key requires a '.' for a namespace
en: 密鑰需要'。'用於命名空間

source: keyword %<typename%> not allowed in this context (a qualified member initializer is implicitly a type)
en: 關鍵字 %<typename%> 不允許用在此上下文中(限定的初始值設定隱含地是一個類型)

source: keyword %<typename%> not allowed outside of templates
en: 關鍵字 %<typename%> 不能在範本以外使用

source: label
en: 標籤

source: label %q+D declared but not defined
en: 標籤 %q+D 宣告後未定義

source: label %q+D defined but not used
en: 標籤 %q+D 定義後未使用

source: label %q+D used but not defined
en: 標籤 %q+D 使用前未定義

source: label %qE referenced outside of any function
en: 標籤 %qE 在所有函式外被參照

source: label at end of compound statement
en: 標籤位於複合敘述末尾

source: language string %<"%E"%> not recognized
en: 語言字串 %<"%E"%> 不可識別

source: large integer implicitly truncated to unsigned type
en: 大整數隱含截斷為無號類型

source: layout of classes derived from empty class %qT may change in a future version of GCC
en: 空類別 %qT 的衍生類別的版面設置在 GCC 的未來版本中可能會起變化

source: ld returned %d exit status
en: ld 回傳 %d

source: left precision
en: 左精度

source: left precision in strfmon format
en: strfmon 格式的左精度

source: left shift count is negative
en: 左移次數為負

source: length modifier
en: 長度修飾符

source: length modifier in printf format
en: printf 格式的長度修飾符

source: length modifier in scanf format
en: scanf 格式的長度修飾符

source: libraries: %s
en: 函式庫：%s

source: library function %q#D redeclared as non-function %q#D
en: 函式庫函式 %q#D 重宣告為非函式 %q#D

source: library lib%s not found
en: 找不到函式庫 lib%s

source: libtool archives are not supported (%s)
en: 不支持libtool存檔（%s)

source: limited
en: 受限

source: local variable memory requirements exceed capacity
en: 局部變數記憶體需求超過容量限制

source: long long constant not a valid immediate operand
en: long long 常數不是一個有效的立即數值運算元

source: long, short, signed or unsigned used invalidly for %qs
en: 為 %qs 使用 long、short、signed 或 unsigned 無效

source: looser throw specifier for %q+#F
en: 放鬆 %q+#F 的 throw 限定

source: lower value in case label range less than minimum value for type
en: case 標籤範圍的下限值比該類型的最小值還要小

source: macro name missing after %qs
en: %qs 後缺少巨集名

source: malformed #pragma GCC visibility push
en: #pragma GCC visibility push 格式錯誤

source: malformed #pragma ghs section
en: 格式錯誤的 #pragma ghs section

source: malformed %<#pragma align%>
en: %<#pragma align%> 格式錯誤

source: malformed %<#pragma align%>, ignoring
en: %<#pragma align%> 格式錯誤 - 已忽略

source: malformed %<#pragma fini%>
en: %<#pragma fini%> 格式錯誤

source: malformed %<#pragma fini%>, ignoring
en: %<#pragma fini%> 格式錯誤 - 已忽略

source: malformed %<#pragma init%>
en: %<#pragma init%> 格式錯誤

source: malformed %<#pragma init%>, ignoring
en: %<#pragma init%> 格式錯誤 - 已忽略

source: malformed %<#pragma pack%> - ignored
en: %<#pragma pack%> 格式錯誤 - 已忽略

source: malformed %<#pragma pack(push[, id][, <n>])%> - ignored
en: %<#pragma pack(push[, id][, <n>])%> 格式錯誤 - 已忽略

source: malformed '#pragma options', ignoring
en: 「#pragma options」格式錯誤 - 已忽略

source: malformed spec function name
en: spec 函式名格式錯誤

source: mandatory option '%s' is missing
en: 找不到必要選項 '%s'

source: mask must be an immediate
en: 遮罩必須是一個立即數值

source: master
en: 主

source: matches this %q+D under ISO standard rules
en: 在 ISO 標準規則下匹配此 %q+D

source: matching constraint not valid in output operand
en: 匹配的約束在輸出運算元中無效

source: matching constraint references invalid operand number
en: 匹配的約束參照了無效的運算元號

source: maximum number of user data entries reached
en: 達到的最大用戶數據條目數

source: maximum number of user data entries reached (%u instead of %u)
en: 達到的最大用戶數據條目數（%u 代替 %u)

source: maximum value of parameter %qs is %u
en: 參數 %qs 的最大值是 %u

source: may not use both -EB and -EL
en: 不能同時使用 -EB 和 -EL

source: may not use both -m32 and -m64
en: 不能同時使用 -m32 和 -m64

source: media functions are not available unless -mmedia is used
en: 多媒體函式只在使用-mmedia 的情況下可用

source: member %q+#D with constructor not allowed in anonymous aggregate
en: 有建構式的成員 %q+#D 不允許在匿名聚合中出現

source: member %q+#D with constructor not allowed in union
en: 有建構式的成員 %q+#D 不能用在聯合中

source: member %q+#D with copy assignment operator not allowed in anonymous aggregate
en: 有複製賦值運算子的成員 %q+#D 不能用在聯合中

source: member %q+#D with copy assignment operator not allowed in union
en: 有複製賦值運算子的成員 %q+#D 不能用在聯合中

source: member %q+#D with destructor not allowed in anonymous aggregate
en: 有構構函式的成員 %q+#D 不允許在匿名聚合中出現

source: member %q+#D with destructor not allowed in union
en: 有解構函式的成員 %q+#D 不能用在聯合中

source: member %qD cannot be declared both virtual and static
en: 成員 %qD 不能既被宣告為虛函式，又被宣告為靜態函式

source: member %qD conflicts with virtual function table field name
en: 成員 %qD 與虛函式表的欄位名衝突

source: member %qD is uninitialized reference
en: 成員 %qD 是未初始化的參照

source: member %qD with uninitialized const fields
en: 成員 %qD 有未初始化的常數欄位

source: member functions are implicitly friends of their class
en: 成員函式隱含地成為所屬類別的夥伴

source: method '%s' not found in class
en: 在類別中找不到方法「%s」

source: method declaration not in @interface context
en: 方法宣告不在@interface 上下文中

source: method possibly missing a [super dealloc] call
en: 方法可能缺少一個 [super dealloc] 呼叫

source: minimum value of parameter %qs is %u
en: 參數 %qs 的最小值為 %u

source: mips16 function profiling
en: mips16 函式取樣

source: misplaced %<@%D%> Objective-C++ construct
en: 位置錯誤的 %<@%D%> Objective-C++ 建構

source: misplaced ConstantValue attribute (not in any field)
en: ConstantValue 屬性位置錯誤(不在任何欄位內)

source: missing $ operand number in format
en: 格式字串缺少 $ 運算元號

source: missing %<(%> after %<#pragma GCC visibility push%> - ignored
en: %<#pragma GCC visibility push%> 缺少 %<(%> — 已忽略

source: missing '(' after '#pragma unused', ignoring
en: 「#pragma unused」後面缺少「(」，忽略

source: missing ')' after '#pragma unused', ignoring
en: 「#pragma unused」後面缺少「)」，忽略

source: missing Code attribute
en: 缺少 Code 屬性

source: missing barrier after block %i
en: 在區塊 %i 之後缺少邊界

source: missing braces around initializer
en: 初始值設定周圍缺少大括號

source: missing close brace for named operand
en: 具名運算元後缺少右大括號

source: missing close paren
en: 缺少右括號

source: missing colon in 'password' entry '%s'
en: '密碼'條目中缺少冒號'%s'

source: missing definition
en: 定義缺失

source: missing dot in 'password' entry '%s'
en: “密碼”條目中缺少點%s'

source: missing field '%s' in '%s'
en: 缺少欄位「%s」，在「%s」中

source: missing filename after %qs
en: %qs 後缺少檔案名稱

source: missing filename to load VPN plugin info
en: 缺少加載VPN插件信息的文件名

source: missing fill character at end of strfmon format
en: strfmon 格式字串末尾缺少填充字元

source: missing initializer
en: 缺少初始值設定

source: missing initializer for member %qD
en: 成員 %qD 缺少初始值設定

source: missing key-value separator '%c' after '%s'
en: 缺少鍵值分隔符'%c' '之後'%s'

source: missing name for VPN plugin info
en: 缺少VPN插件信息的名稱

source: missing name, try one of [%s]
en: 名稱遺失，請嘗試 [%s] 其中之一

source: missing number
en: 缺少數字

source: missing open paren
en: 缺少左括號

source: missing prefix length for %s '%s', defaulting to %d
en: 缺少前綴長度 %s “%s', 默認為 %d

source: missing sentinel in function call
en: 函式呼叫中缺少哨兵

source: missing service for VPN plugin info
en: 缺少VPN插件信息的服務

source: missing terminating %c character
en: 缺少結尾的 %c 字元

source: missing type-name in typedef-declaration
en: typedef 宣告中缺少類型名

source: mixing C++ and Java catches in a single translation unit
en: 在同一個翻譯單元中混合使用 C++ 和 Java 異常獲取

source: more than %d operands in %<asm%>
en: %<asm%> 中的運算元超過 %d 個

source: mudflap: this language is not supported
en: mudflap：這個語言不受支援

source: multidimensional array must have bounds for all dimensions except the first
en: 宣告多維陣列必須至少指定除第一維以外所有維的大小

source: multiple addresses are not allowed for '%s=%s'
en: '不允許多個地址'%s=%s'

source: multiple definition of %q#T
en: %q#T 多次定義

source: multiple fields in union %qT initialized
en: 初始化了聯合 %qT 中的多個欄位

source: multiple function type attributes specified
en: 指定了多個函式類型屬性

source: multiple inline callers
en: 多個內聯呼叫者

source: multiple storage classes in declaration of %qs
en: %qs 的宣告指定了多個存儲類別

source: multiple storage classes in declaration specifiers
en: 宣告指定了多個存儲類別

source: multiple types in one declaration
en: 一個宣告指定了多個類型

source: must contain 8 comma-separated numbers
en: 必須包含 8 個以逗號區隔開的數字

source: mvcle use
en: 使用 mvcle

source: name
en: 名稱

source: name %qD used in a GNU-style designated initializer for an array
en: 名稱 %qD 用在 GNU 風格的陣列指定元素初始值設定中

source: name %qT has incomplete type
en: 名稱 %qT 類型不完全

source: name lookup of %qD changed
en: %qD 的名稱查閱已變更

source: name missing for member function
en: 成員函式沒具名字

source: namespace %qD not allowed in using-declaration
en: 不允許在 using 宣告中使用命名空間 %qD

source: namespace alias %qD not allowed here, assuming %qD
en: 這裡不允許命名空間別名 %qD，假定為 %qD

source: namespace-scope anonymous aggregates must be static
en: 命名空間欄位的匿名聚合必須是靜態的

source: need to insert runtime check for %s
en: 需要為 %s 加入執行時檢查

source: negative insn length
en: 指令長度為負

source: negative integer implicitly converted to unsigned type
en: 負整數隱含轉換為無號類型

source: negative width in bit-field %q+D
en: 位元段 %q+D 寬度為負

source: negative width in bit-field %qs
en: 位元段 %qs 寬度為負

source: neither a valid connection nor device given
en: 連線無效或是無裝置

source: nested assembly dialect alternatives
en: 巢狀的組譯風格指示

source: nested extern declaration of %qD
en: 對 %qD 的巢狀的外部宣告

source: nested function %qs declared %<extern%>
en: 巢狀函式 %qs 被宣告為 %<extern%>

source: nested redefinition of %<enum %E%>
en: 巢狀的 %<enum %E%> 重定義

source: nested redefinition of %<struct %E%>
en: 巢狀的 %<struct %E%> 重定義

source: nested redefinition of %<union %E%>
en: 巢狀的 %<union %E%> 重定義

source: never
en: 永不

source: new cannot be applied to a function type
en: new 不能用於函式類型

source: new cannot be applied to a reference type
en: new 不能用於參照類型

source: new declaration %q#D
en: 對 %q#D 的新宣告

source: new hostname
en: 新主機名稱

source: new types may not be defined in a return type
en: 不能在回傳類型中定義新類型

source: nm-iface-helper is a small, standalone process that manages a single network interface.
en: nm-iface-helper是一個小型的獨立進程，可管理單個網絡接口。

source: nmcli successfully registered as a NetworkManager's secret agent.
en: nmcli成功註冊為NetworkManager的秘密代理。

source: nmcli successfully registered as a polkit agent.
en: nmcli已成功註冊為polkit代理。

source: nmcli tool, version %s
en: nmcli 工具，版本 %s

source: no
en: 否

source: no %q#D member function declared in class %qT
en: 成員函式 %q#D 未在類別 %qT 中宣告

source: no (guessed)
en: 不（猜到）

source: no active connection on device '%s'
en: 裝置「%s」上沒有使用中的連線

source: no active connection or device
en: 沒有使用中的連線或裝置

source: no arguments for spec function
en: spec 函式沒有引數

source: no class template named %q#T in %q#T
en: 沒具名為 %q#T 的類別範本，在%q#T 中

source: no closing %<]%> for %<%%[%> format
en: %<%%[%> 格式沒有相對的 %<]%>

source: no data type for mode %qs
en: 沒有模式為 %qs 的資料類型

source: no default argument for %qD
en: %qD 沒有預設參數

source: no description yet
en: 尚未描述

source: no device found for connection '%s'
en: 連線「%s」沒有找到任何裝置

source: no field %qD found in union being initialized
en: 在初始化的聯合中找不到欄位 %qD

source: no immediate_use list
en: 沒有 immediate_use 清單

source: no low registers available for popping high registers
en: 高暫存器彈堆疊時沒有可用的低暫存器

source: no match for call to %<(%T) (%A)%>
en: 對 %<(%T) (%A)%> 的呼叫沒有匹配

source: no matches converting function %qD to type %q#T
en: 沒有可將函式 %qD 轉換到類型 %q#T 的匹配項

source: no matching function for call to %<%D(%A)%>
en: 對 %<%D(%A)%> 的呼叫沒有匹配的函式

source: no matching function for call to %<%T::%s(%A)%#V%>
en: 對 %<%T::%s(%A)%#V%> 的呼叫沒有匹配的函式

source: no matching push for %<#pragma GCC visibility pop%>
en: 沒有與 %<#pragma GCC visibility pop%> 對應的 push

source: no member function %qD declared in %qT
en: 成員函式 %qD 未在 %qT 中宣告

source: no members matching %<%T::%D%> in %q#T
en: 沒有與 %<%T::%D%> 匹配的成員，在 %q#T 中

source: no previous declaration for %q+D
en: %q+D 先前沒有宣告過

source: no profiling of 64-bit code for this ABI
en: 此 ABI 不支援取樣 64 位元程式碼

source: no register in address
en: 位址中無暫存器

source: no semicolon at end of struct or union
en: 結構或聯合後沒有分號

source: no suitable %<operator %s%> for %qT
en: 沒有合適的 %<operator %s%> 給 %qT

source: no suitable %qD found in class %qT
en: 找不到合適的 %qD，在類別 %qT 中

source: non promiscuous operation is allowed only in passthru mode
en: 只有在passthru模式下才允許非混雜操作

source: non-member %qs cannot be declared %<mutable%>
en: 非成員 %qs 不能被宣告為 %<mutable%>

source: non-object member %qs cannot be declared %<mutable%>
en: 非物件成員 %qs 不能被宣告為 %<mutable%>

source: non-static const member %q+#D in class without a constructor
en: 類別中有非靜態常數成員 %q+#D 卻沒有建構式

source: non-static declaration of %q+D follows static declaration
en: 對 %q+D 的靜態宣告出現在非靜態宣告之後

source: non-static initialization of a flexible array member
en: 對彈性陣列成員非靜態地初始化

source: non-static method %q+D overrides static method
en: 非靜態方法 %q+D 覆寫了靜態方法

source: non-static reference %q+#D in class without a constructor
en: 類別中有非靜態參照 %q+#D，卻沒有提供建構式

source: non-template %qD used as template
en: 非範本 %qD 做為範本

source: non-template type %qT used as a template
en: 非範本類型 %qT 做為範本

source: non-thread-local declaration of %q+D follows thread-local declaration
en: %q+D 的執行緒局部宣告跟在其非執行緒局部宣告之後

source: non-trivial designated initializers not supported
en: 不平凡的代理初始值設定不受支援

source: nonconstant array index in initializer
en: 初始值設定中陣列索引不是常數

source: nonnull argument has invalid operand number (argument %lu)
en: 非空的引數 %lu 運算元號不正確

source: nonnull argument references non-pointer operand (argument %lu, operand %lu)
en: 非空的引數 %lu 參照了非指標運算元 %lu

source: nonnull argument with out-of-range operand number (argument %lu, operand %lu)
en: 非空的引數運算元號越界(引數 %lu，運算元 %lu)

source: nonnull attribute without arguments on a non-prototype
en: 非空的屬性在非原型中沒有引數

source: not a secret property
en: 不是秘密財產

source: not a valid Java .class file
en: 不是一個有效的 Java .class 檔案。

source: not a valid ethernet MAC address #%u at position %lld
en: 不是有效的以太網MAC地址＃%u 在位置 %lld

source: not a valid ethernet MAC address for mask at position %lld
en: 不是位置掩碼的有效以太網MAC地址 %lld

source: not a valid private key
en: 不是一个有效的私钥

source: not enough type information
en: 類型資訊不充分

source: not enough variable arguments to fit a sentinel
en: 變數引數太少，不足以填滿一個哨兵

source: not valid utf-8
en: 無效的utf-8

source: note:
en: 附註：

source: null argument where non-null required (argument %lu)
en: 引數為 NULL，需要非 NULL 值(引數 %lu)

source: number must be 0 or 1
en: 數字必須是 0 或 1

source: number of arguments doesn%'t match built-in prototype
en: 引數個數與內建原型不符

source: number of components of the vector not a power of two
en: 向量中分量數不是 2 的某次方

source: number of counters is %d instead of %d
en: 計數器的數量是 %d 而不是 %d

source: object class '%s' has no property named '%s'
en: 對像類'%s' 沒有名為'的財產%s'

source: object missing in use of %qE
en: 使用 %qE 時缺少物件

source: obsolete option -I- used, please use -iquote instead
en: 使用了過時的選項 -I-，請改用 -iquote

source: obsolete use of designated initializer with %<:%>
en: 使用 %<:%> 來指定元素初始值的作法已過時

source: obsolete use of designated initializer without %<=%>
en: 過時的用法，應使用 %<=%> 來指定元素初始值

source: off
en: 關

source: offload feature has invalid variant type
en: 卸載功能具有無效的變體類型

source: offset of %q+D is not ABI-compliant and may change in a future version of GCC
en: %q+D 的偏移量與 ABI 不相容，並且在 GCC 的未來版本中可能會有變化

source: offset of empty base %qT may not be ABI-compliant and maychange in a future version of GCC
en: 空基礎類別 %qT 的偏移量可能與 ABI 不相容，並且可能在 GCC 的未來版本中變更

source: offset of virtual base %qT is not ABI-compliant and may change in a future version of GCC
en: 虛基礎類別 %qT 的偏移量與 ABI 不相容，並且可能在 GCC 的未來版本中變更

source: offset outside bounds of constant string
en: 偏移量超過字串常數界

source: omitted middle operand to %<?:%> operand cannot be mangled
en: 省略的 %<?:%> 中運算元不能被修飾

source: on
en: 開

source: only declarations of constructors can be %<explicit%>
en: 只有建構式才能被宣告為 %<explicit%>

source: only makes sense with EUI64 address generation mode
en: 僅適用於EUI64地址生成模式

source: only one of '%s' and '%s' can be set
en: 只能設定 '%s' 與 '%s' 其中之一

source: only uninitialized variables can be placed in a .bss section
en: 只有未初始化的變數才能放在 .bss 區段中

source: opaque vector types cannot be initialized
en: 不透明的向量類型不能被初始化

source: openconnect failed with signal %d
en: openconnect因信號失敗 %d

source: openconnect failed with status %d
en: openconnect失敗並顯示狀態 %d

source: openconnect will be run to authenticate. It will return to nmtui when completed.
en: 將運行openconnect進行身份驗證。完成後它將返回nmtui。

source: opening dependency file %s: %m
en: 開啟依賴檔案 %s：%m

source: opening output file %s: %m
en: 開啟輸出檔案 %s：%m

source: operand number missing after %%-letter
en: %% 字母後缺少運算元號

source: operand number out of range
en: 運算元號超出範圍

source: operand number out of range in format
en: 格式字元中運算元號越界

source: operand number specified for format taking no argument
en: 為格式字串指定的運算元號不帶參數

source: operand number specified with suppressed assignment
en: 為格式字串指定的運算元號取消了賦值

source: operation on %qE may be undefined
en: %qE 上的運算結果可能是未定義的

source: optimization may eliminate reads and/or writes to register variables
en: 最佳化可能會去除對暫存器變數的讀寫

source: options enabled:
en: 啟用的選項：

source: options passed:
en: 傳遞的選項：

source: or %<operator=(const %T&)%>
en: 或 %<operator=(const %T&)%>

source: originally indirect function call not considered for inlining
en: 原本間接的函式呼叫不被考慮內聯

source: out of memory
en: 記憶體不足

source: output constraint %d cannot be specified together with "%s" clobber
en: 輸出約束 %d 不能在指定「%s」篡改時被指定

source: output constraint %d must specify a single register
en: 輸出約束 %d 必須指定單一暫存器

source: output constraint %qc for operand %d is not at the beginning
en: 輸出約束 %qc(對運算元 %d)沒有出現在開頭

source: output filename specified twice
en: 輸出檔案名稱指定了兩次

source: output number %d not directly addressable
en: 輸出數 %d 不可直接定址

source: output operand %d must use %<&%> constraint
en: 輸出運算元 %d 必須使用 %<&%> 約束

source: output operand constraint lacks %<=%>
en: 輸出運算元約束缺少 %<=%>

source: output operand is constant in %<asm%>
en: %<asm%> 的輸出運算元是常數

source: overflow in constant expression
en: 常數運算式溢出

source: overflow in enumeration values
en: 列舉值溢出

source: overflow in implicit constant conversion
en: 隱含常數轉換溢出

source: overriding %q+#D
en: 覆寫了 %q+#D

source: packed attribute causes inefficient alignment
en: packed 屬性導致低效率的對齊

source: packed attribute causes inefficient alignment for %q+D
en: packed 屬性導致 %q+D 低效率的對齊

source: packed attribute is unnecessary
en: 不需要 packed 屬性

source: packed attribute is unnecessary for %q+D
en: packed 屬性對 %q+D 來說是不需要的

source: padding struct to align %q+D
en: 填補結構以對齊 %q+D

source: parameter %P has incomplete type %qT
en: 參數 %P 的類型 %qT 不完全

source: parameter %P of %qD has incomplete type %qT
en: 參數 %P (屬於 %qD)的類型 %qT 不完全

source: parameter %q+D has just a forward declaration
en: 參數 %q+D 有一個前向宣告

source: parameter %qD is initialized
en: 參數 %qD 已初始化

source: parameter may not have variably modified type %qT
en: 參數不能具有可變類型 %qT

source: parameter names (without types) in function declaration
en: 函式宣告中出現參數名卻未指定類型

source: partial specialization %qT declared %<friend%>
en: 部分特例化範本 %qT 宣告為 %<friend%>

source: partial specialization %qT does not specialize any template arguments
en: 部分特例化 %qT 並未特例化任何範本參數

source: passing %qT as %<this%> argument of %q#D discards qualifiers
en: 將 %qT 做為 %q#D 的 %<this%> 引數時丟棄了類型限定

source: passing %qT chooses %qT over %qT
en: 傳遞 %qT 時選擇 %qT 而不是 %qT

source: passing NULL to non-pointer argument %P of %qD
en: 將 NULL 做為非指標引數 %P 傳遞給 %qD

source: passing arg %d of %qE discards qualifiers frompointer target type
en: 傳遞參數 %d (屬於 %qE)時丟棄了指標目的類型的類型限定

source: passing argument %d of %qE as complex rather than floating due to prototype
en: 根據原型，引數 %d (%qE) 將做為複數而不是浮點數傳遞

source: passing argument %d of %qE as complex rather than integer due to prototype
en: 根據原型，引數 %d (%qE) 將做為複數而不是整數傳遞

source: passing argument %d of %qE as floating rather than complex due to prototype
en: 根據原型，引數 %d (%qE) 將做為浮點數而不是複數傳遞

source: passing argument %d of %qE as floating rather than integer due to prototype
en: 根據原型，引數 %d (%qE) 將做為浮點數而不是整數傳遞

source: passing argument %d of %qE as integer rather than complex due to prototype
en: 根據原型，引數 %d (%qE) 將做為整數而不是複數傳遞

source: passing argument %d of %qE as integer rather than floating due to prototype
en: 根據原型，引數 %d (%qE) 將做為整數而不是浮點數傳遞

source: passing argument %d of %qE as unsigned due to prototype
en: 根據原型，引數 %d (%qE) 將作用無號數傳遞

source: passing argument %d of %qE from incompatible pointer type
en: 傳遞參數 %d (屬於 %qE)時在不相容的指標類型間轉換

source: passing argument %d of %qE makes integer from pointer without a cast
en: 傳遞參數 %d (屬於 %qE)時將指標賦給整數，未作類型轉換
